project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/read_only/expensive_read.log
bench with linearizable range
 0 / 11 B                                                                                                                                          !   0.00%INFO: 2023/06/12 13:55:47 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 13:55:47 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 13:55:47 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 11 / 11 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 10s

Summary:
  Total:	10.1526 secs.
  Slowest:	0.2073 secs.
  Fastest:	0.1323 secs.
  Average:	0.1488 secs.
  Stddev:	0.0197 secs.
  Requests/sec:	1.0835

Response time histogram:
  0.1323 [1]	|∎∎∎∎∎∎∎∎∎∎
  0.1398 [3]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1473 [2]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1548 [4]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.1623 [0]	|
  0.1698 [0]	|
  0.1773 [0]	|
  0.1848 [0]	|
  0.1923 [0]	|
  0.1998 [0]	|
  0.2073 [1]	|∎∎∎∎∎∎∎∎∎∎

Latency distribution:
  10% in 0.1360 secs.
  25% in 0.1370 secs.
  50% in 0.1483 secs.
  75% in 0.1520 secs.
  90% in 0.2073 secs.